# ==============================================================================
# STAGE 1: BUILDER
# Собираем приложение в контейнере с Go
# ==============================================================================
FROM golang:1.25.3-alpine AS builder

# Устанавливаем рабочую директорию внутри сборщика
WORKDIR /build

# 1. Сначала копируем только файлы зависимостей.
# Это позволяет кешировать слой с библиотеками. Если ты поменяешь код, но не go.mod,
# этот шаг не будет выполняться заново, что ускорит сборку в CI/CD.
COPY go.mod go.sum ./
RUN go mod download

# 2. Теперь копируем весь исходный код
COPY . .

# 3. Компиляция
# CGO_ENABLED=0: Отключаем C-библиотеки для создания статически слинкованного бинарника.
# GOOS=linux: Целевая ОС.
# -ldflags="-s -w": Убираем отладочную информацию (Dwarf tables) и символы,
# что уменьшает размер бинарника на ~30%.
RUN CGO_ENABLED=0 GOOS=linux go build -ldflags="-s -w" -o api ./api/cmd/api/main.go

# ==============================================================================
# STAGE 2: RUNTIME
# Создаем финальный минималистичный образ
# ==============================================================================
FROM alpine:latest

# Устанавливаем корневые сертификаты (нужны, если Kafka/Redis используют TLS)
# и tzdata (для корректной работы с Timezone, если нужно)
RUN apk --no-cache add ca-certificates tzdata

# Создаем пользователя без прав root (Security Best Practice)
RUN addgroup -S appgroup && adduser -S appuser -G appgroup

# Рабочая директория
WORKDIR /app

# Копируем только скомпилированный бинарник из первого этапа
COPY --from=builder /build/api .

# Переключаемся на безопасного пользователя
USER appuser

# Открываем порт (информативно)
EXPOSE 8083

# Запускаем приложение
CMD ["./api"]